results/raw/sessionA/bench_S3_r4_rep1.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7cea417f2480>, trust_remote_code=False, seed=1, num_prompts=200, dataset_name='sharegpt', no_stream=False, dataset_path='/workspace/ShareGPT_V3_unfiltered_cleaned_split.json', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen2.5-0.5B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=4.0, burstiness=1.0, disable_tqdm=False, num_warmups=30, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='results/raw/sessionA/bench', result_filename='S3_r4_rep1.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-e08898b1-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 30 requests...
100%|██████████| 30/30 [00:01<00:00, 16.81it/s]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 4.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 200/200 [00:51<00:00,  3.89it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Request rate configured (RPS):           4.00      
Benchmark duration (s):                  51.38     
Total input tokens:                      47032     
Total generated tokens:                  40514     
Request throughput (req/s):              3.89      
Output token throughput (tok/s):         788.46    
Peak output token throughput (tok/s):    1429.00   
Peak concurrent requests:                14.00     
Total token throughput (tok/s):          1703.77   
---------------Time to First Token----------------
Mean TTFT (ms):                          34.95     
Median TTFT (ms):                        31.51     
P50 TTFT (ms):                           31.51     
P95 TTFT (ms):                           51.24     
P99 TTFT (ms):                           56.98     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          5.58      
Median TPOT (ms):                        5.61      
P50 TPOT (ms):                           5.61      
P95 TPOT (ms):                           6.07      
P99 TPOT (ms):                           6.72      
---------------Inter-token Latency----------------
Mean ITL (ms):                           5.66      
Median ITL (ms):                         5.41      
P50 ITL (ms):                            5.41      
P95 ITL (ms):                            6.61      
P99 ITL (ms):                            15.04     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          1176.39   
Median E2EL (ms):                        736.87    
P50 E2EL (ms):                           736.87    
P95 E2EL (ms):                           4097.84   
P99 E2EL (ms):                           4558.64   
==================================================